#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2025z-324021/global/networks/main-vpc]
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2025z-324021/artifactregistry.googleapis.com]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2025z-324021-data]
google_compute_network.infracost_net: Refreshing state... [id=projects/tbd-2025z-324021/global/networks/infracost-net]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2025z-324021-code]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2025z-324021/roles/composer.ServiceAgentV2Ext/serviceAccount:service-275733941798@cloudcomposer-accounts.iam.gserviceaccount.com]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2025z-324021/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2025z-324021/regions/europe-west1/subnetworks/subnet-01]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2025z-324021/regions/europe-west1/routers/nat-router]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2025z-324021/global/firewalls/default-internal-allow-all]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2025z-324021/global/firewalls/allow-all-internal]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2025z-324021-code-spark-job.py]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2025z-324021/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2025z-324021/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2025z-324021/dataproc.googleapis.com]
module.dataproc.google_service_account.dataproc_sa: Refreshing state... [id=projects/tbd-2025z-324021/serviceAccounts/tbd-2025z-324021-dataproc-sa@tbd-2025z-324021.iam.gserviceaccount.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2025z-324021/composer.googleapis.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2025z-324021/regions/europe-west1/subnetworks/composer-subnet-01]
module.dataproc.google_storage_bucket.dataproc_temp: Refreshing state... [id=tbd-2025z-324021-dataproc-temp]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2025z-324021/serviceAccounts/tbd-2025z-324021-data@tbd-2025z-324021.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket.dataproc_staging: Refreshing state... [id=tbd-2025z-324021-dataproc-staging]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2025z-324021/roles/iam.serviceAccountUser/serviceAccount:tbd-2025z-324021-data@tbd-2025z-324021.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2025z-324021/roles/dataproc.editor/serviceAccount:tbd-2025z-324021-data@tbd-2025z-324021.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2025z-324021/roles/composer.worker/serviceAccount:tbd-2025z-324021-data@tbd-2025z-324021.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_data_editor: Refreshing state... [id=tbd-2025z-324021/roles/bigquery.dataEditor/serviceAccount:tbd-2025z-324021-dataproc-sa@tbd-2025z-324021.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_worker: Refreshing state... [id=tbd-2025z-324021/roles/dataproc.worker/serviceAccount:tbd-2025z-324021-dataproc-sa@tbd-2025z-324021.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2025z-324021-code/roles/storage.objectViewer/serviceAccount:tbd-2025z-324021-data@tbd-2025z-324021.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_user: Refreshing state... [id=tbd-2025z-324021/roles/bigquery.user/serviceAccount:tbd-2025z-324021-dataproc-sa@tbd-2025z-324021.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2025z-324021-data/roles/storage.objectUser/serviceAccount:tbd-2025z-324021-data@tbd-2025z-324021.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.temp_bucket_iam: Refreshing state... [id=b/tbd-2025z-324021-dataproc-temp/roles/storage.objectAdmin/serviceAccount:tbd-2025z-324021-dataproc-sa@tbd-2025z-324021.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.staging_bucket_iam: Refreshing state... [id=b/tbd-2025z-324021-dataproc-staging/roles/storage.objectAdmin/serviceAccount:tbd-2025z-324021-dataproc-sa@tbd-2025z-324021.iam.gserviceaccount.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2025z-324021/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2025z-324021/regions/europe-west1/clusters/tbd-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # google_compute_instance.my_instance will be created
  + resource "google_compute_instance" "my_instance" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = (known after apply)
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-16"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "infracost-test"
      + project              = "tbd-2025z-324021"
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = (known after apply)
      + zone                 = "europe-west1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "projects/debian-cloud/global/images/family/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "https://www.googleapis.com/compute/v1/projects/tbd-2025z-324021/global/networks/infracost-net"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)
    }

  # kubernetes_service.dbt-task-service will be created
  + resource "kubernetes_service" "dbt-task-service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dbt-app"
            }
          + name             = "dbt-task-service"
          + namespace        = "composer-user-workloads"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "dbt-app"
            }
          + session_affinity                  = "None"
          + type                              = "NodePort"

          + port {
              + name        = "spark-driver"
              + node_port   = 30000
              + port        = 30000
              + protocol    = "TCP"
              + target_port = "30000"
            }
          + port {
              + name        = "spark-block-mgr"
              + node_port   = 30001
              + port        = 30001
              + protocol    = "TCP"
              + target_port = "30001"
            }

          + session_affinity_config (known after apply)
        }
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2025z-324021/dbt:1.8.7"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION" = "1.8.0"
              + "DBT_VERSION"       = "1.8.7"
              + "PROJECT_NAME"      = "tbd-2025z-324021"
              + "SPARK_VERSION"     = "3.5.1"
            }
          + cache_from     = []
          + context        = "modules/dbt_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2025z-324021/dbt:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.dbt_docker_image.docker_registry_image.dbt will be created
  + resource "docker_registry_image" "dbt" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2025z-324021/dbt:1.8.7"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }
    }

  # module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0] will be destroyed
  # (because google_project_iam_member.composer_agent_service_account is not in configuration)
  - resource "google_project_iam_member" "composer_agent_service_account" {
      - etag    = "BwZE2w+5s8k=" -> null
      - id      = "tbd-2025z-324021/roles/composer.ServiceAgentV2Ext/serviceAccount:service-275733941798@cloudcomposer-accounts.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-275733941798@cloudcomposer-accounts.iam.gserviceaccount.com" -> null
      - project = "tbd-2025z-324021" -> null
      - role    = "roles/composer.ServiceAgentV2Ext" -> null
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

```

</details>

*Pusher: @DWelloo, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*